Edit README.md based on latest changes
